CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_adc.h
/* ADC_IOFFx x=0..3 */
#define ADC_IOFFX_IOFF                  BITS(0, 11)                       /*!< data offset for inserted channel x */

/* ADC_WDHT */
#define ADC_WDHT_WDHT                   BITS(0, 11)                       /*!< analog watchdog high threshold */

/* ADC_WDLT */
#define ADC_WDLT_WDLT                   BITS(0, 11)                       /*!< analog watchdog low threshold */

/* ADC_RSQx */
#define ADC_RSQX_RSQN                   BITS(0, 4)                        /*!< x(x = 0..8) conversion in regular sequence */
#define ADC_RSQ0_RL                     BITS(20, 23)                      /*!< regular channel sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN                    BITS(0, 4)                        /*!< x conversion in inserted sequence */
#define ADC_ISQ_IL                      BITS(20, 21)                      /*!< inserted sequence length */

/* ADC_IDATAx x=0..3*/
#define ADC_IDATAX_IDATAN               BITS(0, 15)                       /*!< inserted channel x conversion data */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                 BITS(0, 15)                       /*!< regular data */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN             BIT(0)                            /*!< oversampling enable */
#define ADC_OVSAMPCTL_OVSR              BITS(2, 4)                        /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS              BITS(5, 8)                        /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS              BIT(9)                            /*!< triggered oversampling */

/* ADC_CCTL */
#define ADC_CCTL_ADCCK                  BITS(16, 18)                      /*!< ADC clock */
#define ADC_CCTL_VBATEN                 BIT(22)                           /*!< channel 11 (1/4 voltate of external battery) enable of ADC */
#define ADC_CCTL_TSVREN                 BIT(23)                           /*!< channel 9 (temperature sensor) and 10 (internal reference voltage) enable of ADC */

/* constants definitions */
/* ADC status flag */
#define ADC_FLAG_WDE                    ADC_STAT_WDE                                /*!< analog watchdog event flag */
#define ADC_FLAG_EOC                    ADC_STAT_EOC                                /*!< end of conversion */
#define ADC_FLAG_EOIC                   ADC_STAT_EOIC                               /*!< inserted channel end of conversion */
#define ADC_FLAG_STIC                   ADC_STAT_STIC                               /*!< inserted channel start flag */
#define ADC_FLAG_STRC                   ADC_STAT_STRC                               /*!< regular channel start flag */
#define ADC_FLAG_ROVF                   ADC_STAT_ROVF                               /*!< regular data register overflow */

/* ADC_CTL0 register value */
#define CTL0_DISNUM(regval)             (BITS(13, 15) & ((uint32_t)(regval) << 13)) /*!< write value to ADC_CTL0_DISNUM bit field */

/* ADC special function definitions */
#define ADC_SCAN_MODE                   ADC_CTL0_SM                                 /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO       ADC_CTL0_ICA                                /*!< inserted channel group convert automatically */
#define ADC_CONTINUOUS_MODE             ADC_CTL1_CTN                                /*!< continuous mode */

/* temperature sensor channel, internal reference voltage channel, VBAT channel */
#define ADC_VBAT_CHANNEL_SWITCH         ADC_CCTL_VBATEN                             /*!< VBAT channel */
#define ADC_TEMP_VREF_CHANNEL_SWITCH    ADC_CCTL_TSVREN                             /*!< Vref and Vtemp channel */

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT             ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT              ADC_CTL1_DAL                                /*!< MSB alignment */

/* external trigger mode for regular and inserted  channel */
#define EXTERNAL_TRIGGER_DISABLE        ((uint32_t)0x00000000U)                     /*!< external trigger disable */
#define EXTERNAL_TRIGGER_RISING         ((uint32_t)0x00000001U)                     /*!< rising edge of external trigger */
#define EXTERNAL_TRIGGER_FALLING        ((uint32_t)0x00000002U)                     /*!< falling edge of external trigger */
#define EXTERNAL_TRIGGER_RISING_FALLING ((uint32_t)0x00000003U)                     /*!< rising and falling edge of external trigger */

/* ADC external trigger select for regular channel */
#define CTL1_ETSRC(regval)              (BITS(24, 27) & ((uint32_t)(regval) << 24))
#define ADC_EXTTRIG_REGULAR_T0_CH0      CTL1_ETSRC(0)                               /*!< TIMER0 CH0 event select */
#define ADC_EXTTRIG_REGULAR_T0_CH1      CTL1_ETSRC(1)                               /*!< TIMER0 CH1 event select */
#define ADC_EXTTRIG_REGULAR_T0_CH2      CTL1_ETSRC(2)                               /*!< TIMER0 CH2 event select */
#define ADC_EXTTRIG_REGULAR_T1_CH1      CTL1_ETSRC(3)                               /*!< TIMER1 CH1 event select */
#define ADC_EXTTRIG_REGULAR_T1_CH2      CTL1_ETSRC(4)                               /*!< TIMER1 CH2 event select */
#define ADC_EXTTRIG_REGULAR_T1_CH3      CTL1_ETSRC(5)                               /*!< TIMER1 CH3 event select */
#define ADC_EXTTRIG_REGULAR_T1_TRGO     CTL1_ETSRC(6)                               /*!< TIMER1 TRGO event select */
#define ADC_EXTTRIG_REGULAR_T2_CH0      CTL1_ETSRC(7)                               /*!< TIMER2 CH0 event select */
#define ADC_EXTTRIG_REGULAR_T2_TRGO     CTL1_ETSRC(8)                               /*!< TIMER2 TRGO event select */
#define ADC_EXTTRIG_REGULAR_T3_CH3      CTL1_ETSRC(9)                               /*!< TIMER3 CH3 event select */
#define ADC_EXTTRIG_REGULAR_T4_CH0      CTL1_ETSRC(10)                              /*!< TIMER4 CH0 event select */
#define ADC_EXTTRIG_REGULAR_T4_CH1      CTL1_ETSRC(11)                              /*!< TIMER4 CH1 event select */
#define ADC_EXTTRIG_REGULAR_T4_CH2      CTL1_ETSRC(12)                              /*!< TIMER4 CH2 event select */
#define ADC_EXTTRIG_REGULAR_EXTI_11     CTL1_ETSRC(15)                              /*!< external interrupt line 11 select  */

