CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_adc.h
/* ADC inserted channel definitions */
#define ADC_INSERTED_CHANNEL_0          ((uint8_t)0x00U)                            /*!< ADC inserted channel 0 */
#define ADC_INSERTED_CHANNEL_1          ((uint8_t)0x01U)                            /*!< ADC inserted channel 1 */
#define ADC_INSERTED_CHANNEL_2          ((uint8_t)0x02U)                            /*!< ADC inserted channel 2 */
#define ADC_INSERTED_CHANNEL_3          ((uint8_t)0x03U)                            /*!< ADC inserted channel 3 */

/* ADC channel definitions */
#define ADC_CHANNEL_0                   ((uint8_t)0x00U)                            /*!< ADC channel 0 */
#define ADC_CHANNEL_1                   ((uint8_t)0x01U)                            /*!< ADC channel 1 */
#define ADC_CHANNEL_2                   ((uint8_t)0x02U)                            /*!< ADC channel 2 */
#define ADC_CHANNEL_3                   ((uint8_t)0x03U)                            /*!< ADC channel 3 */
#define ADC_CHANNEL_4                   ((uint8_t)0x04U)                            /*!< ADC channel 4 */
#define ADC_CHANNEL_5                   ((uint8_t)0x05U)                            /*!< ADC channel 5 */
#define ADC_CHANNEL_6                   ((uint8_t)0x06U)                            /*!< ADC channel 6 */
#define ADC_CHANNEL_7                   ((uint8_t)0x07U)                            /*!< ADC channel 7 */
#define ADC_CHANNEL_8                   ((uint8_t)0x08U)                            /*!< ADC channel 8 */
#define ADC_CHANNEL_9                   ((uint8_t)0x09U)                            /*!< ADC channel 9 */
#define ADC_CHANNEL_10                  ((uint8_t)0x0AU)                            /*!< ADC channel 10 */
#define ADC_CHANNEL_11                  ((uint8_t)0x0BU)                            /*!< ADC channel 11 */

/* ADC interrupt flag */
#define ADC_INT_WDE                     ADC_CTL0_WDEIE                              /*!< analog watchdog event interrupt */
#define ADC_INT_EOC                     ADC_CTL0_EOCIE                              /*!< end of group conversion interrupt */
#define ADC_INT_EOIC                    ADC_CTL0_EOICIE                             /*!< end of inserted group conversion interrupt */
#define ADC_INT_ROVF                    ADC_CTL0_ROVFIE                             /*!< regular data register overflow */

/* ADC interrupt flag */
#define ADC_INT_FLAG_WDE                ADC_STAT_WDE                                /*!< analog watchdog event interrupt */
#define ADC_INT_FLAG_EOC                ADC_STAT_EOC                                /*!< end of group conversion interrupt */
#define ADC_INT_FLAG_EOIC               ADC_STAT_EOIC                               /*!< end of inserted group conversion interrupt */
#define ADC_INT_FLAG_ROVF               ADC_STAT_ROVF                               /*!< regular data register overflow */

/* configure the ADC clock */
#define CCTL_ADCCK(regval)              (BITS(16,18) & ((uint32_t)(regval) << 16))
#define ADC_ADCCK_PCLK2_DIV2            CCTL_ADCCK(0)                               /*!< PCLK2 div2 */
#define ADC_ADCCK_PCLK2_DIV4            CCTL_ADCCK(1)                               /*!< PCLK2 div4 */
#define ADC_ADCCK_PCLK2_DIV6            CCTL_ADCCK(2)                               /*!< PCLK2 div6 */
#define ADC_ADCCK_PCLK2_DIV8            CCTL_ADCCK(3)                               /*!< PCLK2 div8 */
#define ADC_ADCCK_HCLK_DIV5             CCTL_ADCCK(4)                               /*!< HCLK div5 */
#define ADC_ADCCK_HCLK_DIV6             CCTL_ADCCK(5)                               /*!< HCLK div6 */
#define ADC_ADCCK_HCLK_DIV10            CCTL_ADCCK(6)                               /*!< HCLK div10 */
#define ADC_ADCCK_HCLK_DIV20            CCTL_ADCCK(7)                               /*!< HCLK div20 */

/* end of conversion mode */
#define ADC_EOC_SET_SEQUENCE            ((uint8_t)0x00U)                            /*!< only at the end of a sequence of regular conversions, the EOC bit is set */
#define ADC_EOC_SET_CONVERSION          ((uint8_t)0x01U)                            /*!< at the end of each regular conversion, the EOC bit is set */

/* function declarations */
/* ADC deinitialization and initialization functions */
/* reset ADC */
void adc_deinit(void);
/* configure the ADC clock */
void adc_clock_config(uint32_t prescaler);
/* enable ADC interface */
void adc_enable(void);
/* disable ADC interface */
void adc_disable(void);

/* ADC DMA functions */
/* enable DMA request */
void adc_dma_mode_enable(void);
/* disable DMA request */
void adc_dma_mode_disable(void);
/* when DMA=1, the DMA engine issues a request at end of each regular conversion */
void adc_dma_request_after_last_enable(void);
/* the DMA engine is disabled after the end of transfer signal from DMA controller is detected */
void adc_dma_request_after_last_disable(void);

/* ADC special function functions */
/* configure ADC discontinuous mode */
void adc_discontinuous_mode_config(uint8_t channel_group, uint8_t length);
/* enable or disable ADC special function */
void adc_special_function_config(uint32_t function, ControlStatus newvalue);
/* configure temperature sensor and internal reference voltage channel or VBAT channel function */
void adc_channel_9_to_11(uint32_t function, ControlStatus newvalue);

/* ADC channel configuration functions */
/* configure ADC data alignment */
void adc_data_alignment_config(uint32_t data_alignment);
/* configure the length of regular channel group or inserted channel group */
void adc_channel_length_config(uint8_t channel_group, uint32_t length);
/* configure ADC regular channel */
void adc_regular_channel_config(uint8_t rank, uint8_t channel, uint32_t sample_time);
/* configure ADC inserted channel */
void adc_inserted_channel_config(uint8_t rank, uint8_t channel, uint32_t sample_time);
/* configure ADC inserted channel offset */
void adc_inserted_channel_offset_config(uint8_t inserted_channel, uint16_t offset);

/* ADC external trigger functions */
/* configure ADC external trigger */
void adc_external_trigger_config(uint8_t channel_group, uint32_t trigger_mode);
/* configure ADC external trigger source */
void adc_external_trigger_source_config(uint8_t channel_group, uint32_t external_trigger_source);
/* enable ADC software trigger */
void adc_software_trigger_enable(uint8_t channel_group);
/* configure end of conversion mode */
void adc_end_of_conversion_config(uint8_t end_selection);

/* ADC data read functions */
/* read ADC regular group data register */
uint16_t adc_regular_data_read(void);
/* read ADC inserted group data register */
uint16_t adc_inserted_data_read(uint8_t inserted_channel);

/* ADC analog watchdog functions */
/* enable ADC analog watchdog single channel */
void adc_watchdog_single_channel_enable(uint8_t channel);
/* configure ADC analog watchdog group channel */
void adc_watchdog_group_channel_enable(uint8_t channel_group);
/* disable ADC analog watchdog */
void adc_watchdog_disable(void);
/* configure ADC analog watchdog threshold */
void adc_watchdog_threshold_config(uint16_t low_threshold, uint16_t high_threshold);

/* ADC oversample functions */
/* configure ADC oversample mode */
void adc_oversample_mode_config(uint32_t mode, uint16_t shift, uint8_t ratio);
/* enable ADC oversample mode */
void adc_oversample_mode_enable(void);
/* disable ADC oversample mode */
void adc_oversample_mode_disable(void);

/* flag and interrupt functions */
/* get the ADC flag */
FlagStatus adc_flag_get(uint32_t flag);
/* clear the ADC flag */
void adc_flag_clear(uint32_t flag);
/* enable ADC interrupt */
void adc_interrupt_enable(uint32_t interrupt);
/* disable ADC interrupt */
void adc_interrupt_disable(uint32_t interrupt);
/* get the ADC interrupt */
FlagStatus adc_interrupt_flag_get(uint32_t int_flag);
/* clear the ADC flag */
void adc_interrupt_flag_clear(uint32_t int_flag);
/* get the bit state of ADC software start conversion */
FlagStatus adc_regular_software_startconv_flag_get(void);
/* get the bit state of ADC software inserted channel start conversion */
FlagStatus adc_inserted_software_startconv_flag_get(void);

#endif /* GD32W51X_ADC_H */
